[
{"id":5,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Brush-tailed_Porcupine%2C_Atherurus_macrourus_in_Kaeng_Krachan_national_park_%2815925250476%29.jpg/800px-Brush-tailed_Porcupine%2C_Atherurus_macrourus_in_Kaeng_Krachan_national_park_%2815925250476%29.jpg","name":"Asiatic brush-tailed porcupine","suborder":"Hystricomorpha","family":"Hystricidae","source":"https://en.wikipedia.org/wiki/Asiatic_brush-tailed_porcupine","genus":"Atherurus","detail":"The Asiatic brush-tailed porcupine (Atherurus macrourus) is a species of rodent in the family Hystricidae. It is found in China, India, Laos, Malaysia, Myanmar, Thailand, and Vietnam. It is a nocturnal and fossorial species, occurring in subtropical and tropical montane forests. It is found on the forest floor, often in areas with profuse undergrowth interspersed with cane and bamboo brakes and palms."},
{"id":6,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Hystrix_brachyura%2C_Malayan_porcupine.jpg/1024px-Hystrix_brachyura%2C_Malayan_porcupine.jpg","name":"Malayan porcupine","suborder":"Hystricomorpha","family":"Hystricidae","source":"32.77.128.66","genus":"Hystrix","detail":"The Malayan porcupine or Himalayan porcupine (Hystrix brachyura) is a species of rodent in the family Hystricidae.[4] Three subspecies are extant in South and Southeast Asia. This species and its close relatives are believed to have originated from southern Asia based on their current distribution. Their origin may lie from a common Late Pleistocene ancestor when Sumatra, Borneo, and Palawan were part of Sundaland."},
{"id":2,"image":"https://upload.wikimedia.org/wikipedia/commons/d/da/CTENODACTYLUSvali.jpg","name":"Val's gundi","suborder":"Hystricomorpha","family":"Ctenodactylidae","source":"https://en.wikipedia.org/wiki/Val%27s_gundi","genus":"Ctenodactylus","detail":"Val's gundi (Ctenodactylus vali) is a species of rodent in the family Ctenodactylidae. It is known from two widely separated areas of North Africa. Val's gundi is very similar to the other species of gundi, especially the common gundi, with grey, soft, silky fur and a resemblance to guinea pigs. They have rounded ears; round eyes; stocky, blunt nosed bodies; short legs; short necks; and short, furry tails."},
{"id":7,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Chinchilla_lanigera1.jpg/1024px-Chinchilla_lanigera1.jpg","name":"Long-tailed chinchilla","suborder":"Hystricomorpha","family":"Chinchillidae","source":"https://en.wikipedia.org/wiki/Long-tailed_chinchilla","genus":"Chinchilla","detail":"The long-tailed chinchilla (Chinchilla lanigera), also called the Chilean, coastal, common, or lesser chinchilla, is one of two species of rodent from the genus Chinchilla: the other species being C. chinchilla.[2] Both species are endangered in the wild after historically being hunted for their soft hair coats. Domestic breeds of chinchilla are believed to descend from specimens of C. lanigera. Domestic chinchillas come in three types: la plata, costina, and raton. Historically, Chilean chinchillas were reported from Talca (35°30’S), Chile, north to Peru,[3] and also eastward, from Chilean coastal hills, throughout low mountains."},
{"id":8,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Bolivian_vizcacha.jpg/1024px-Bolivian_vizcacha.jpg","name":"Southern viscacha","suborder":"Hystricomorpha","family":"Chinchillidae","source":"https://en.wikipedia.org/wiki/Southern_viscacha","genus":"Lagidium","detail":"The southern viscacha (Lagidium viscacia) is a species of viscacha, a rodent in the family Chinchillidae found in Argentina, Bolivia, Chile, and Peru. It is a colonial animal living in small groups in rocky mountain areas. It has long ears and hind legs and resembles a rabbit in appearance apart from its long, bushy tail, but is not a lagomorph. The southern viscacha has yellowish-grey upperparts, paler underparts, and a black-tipped, bushy tail. The body fur is long and soft, while that on the tail is coarse. The long, fur-covered ears have a white fringe and both the short front legs and longer hind legs have four digits on the feet. The soles of the feet have fleshy pads called pallipes and they can move about with agility over rocky surfaces. The weight of an adult southern viscacha is about 3 kg (6.6 lb)"},
{"id":9,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Springharelg.jpg/800px-Springharelg.jpg","name":"Pedetes","suborder":" Anomaluromorpha","family":"Pedetidae","source":"https://en.wikipedia.org/wiki/Pedetes","genus":"Pedetes","detail":"Pedetes is a genus of rodent, the springhares, in the family Pedetidae. Members of the genus are distributed across southern and Eastern Africa. These rodents are generally nocturnal and sleep through the day in burrows they dig. They feed on foliage, roots and other vegetable matter, and occasionally arthropods. Outside the burrow they usually move around by hopping on their hind legs."},
{"id":10,"image":"https://upload.wikimedia.org/wikipedia/commons/9/95/Indian_giant_flying_squirrel.jpg","name":"Indian giant flying squirrel","suborder":"Anomaluromorpha","family":"Sciuridae","source":"https://en.wikipedia.org/wiki/Indian_giant_flying_squirrel","genus":"Petaurista","detail":"The Indian giant flying squirrel (Petaurista philippensis), also called the large brown flying squirrel or the common giant flying squirrel, is a species of rodent in the family Sciuridae. It is capable of gliding flight using a skin membrane stretched between front and hind legs. It is found in mainland Southeast and South Asia, and southern and central China."},
{"id":11,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Congo_rope_squirrel_%28Funisciurus_congicus%29.jpg/1024px-Congo_rope_squirrel_%28Funisciurus_congicus%29.jpg","name":"Congo rope squirrel","suborder":"Anomaluromorpha","family":"Sciuridae","source":"https://en.wikipedia.org/wiki/Congo_rope_squirrel","genus":"Funisciurus","detail":"The Congo rope squirrel (Funisciurus congicus) is a species of rodent in the family Sciuridae. It is found in Angola, Democratic Republic of the Congo, and Namibia. Its natural habitats are moist savanna, subtropical or tropical dry shrubland, and rocky areas."},
{"id":12,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Atlantoxerus_getulus.jpg/800px-Atlantoxerus_getulus.jpg","name":"Barbary ground squirrel","suborder":"Anomaluromorpha","family":"Sciuridae","source":"https://en.wikipedia.org/wiki/Barbary_ground_squirrel","genus":"Atlantoxerus","detail":"The Barbary ground squirrel (Atlantoxerus getulus) is a species of rodent in the family Sciuridae. It is monotypic within the genus Atlantoxerus.[3] It is endemic to Western Sahara, Algeria, and Morocco, and has been introduced into the Canary Islands. Its natural habitats are subtropical or tropical dry shrubland, temperate grassland and rocky areas where it lives colonially in burrows. It was first described by Carl Linnaeus in his landmark 1758 10th edition of Systema Naturae."},
{"id":13,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/A_Sciuridae_in_Taipei_4.JPG/800px-A_Sciuridae_in_Taipei_4.jpg","name":"Pallas's squirrel","suborder":"Anomaluromorpha","family":"Sciuridae","source":"https://en.wikipedia.org/wiki/Pallas%27s_squirrel","genus":"Callosciurus","detail":"Pallas's squirrel is a medium-sized tree squirrel, with a head-body length of 16 to 28 cm (6.3 to 11.0 in), and a tail 11 to 26 cm (4.3 to 10.2 in) in length. Both sexes are of similar size and appearance, and weigh between 310 and 460 g (11 and 16 oz). The colour of the pelt varies considerably between the many different subspecies, but is generally brownish on the upper body with a more reddish tint on the belly, and often with some black on the tail. The precise pattern and shades of the fur are often used to distinguish subspecies from one another, but make it difficult to distinguish the species as a whole from other, similarly variable, tree squirrel species"},
{"id":14,"image":"https://upload.wikimedia.org/wikipedia/commons/5/53/Common_spiny_mouse.JPG","name":"Cairo spiny mouse","suborder":"Myomorpha","family":"Muridae","source":"https://en.wikipedia.org/wiki/Cairo_spiny_mouse","genus":"Acomys","detail":"The Cairo spiny mouse (Acomys cahirinus), also known as the common spiny mouse, Egyptian spiny mouse, or Arabian spiny mouse, is a nocturnal species of rodent in the family Muridae. It is found in Africa north of the Sahara, where its natural habitats are rocky areas and hot deserts. It is omnivorous and feeds on seeds, desert plants, snails, and insects. It is a gregarious animal and lives in small family groups."},
{"id":15,"image":"https://upload.wikimedia.org/wikipedia/commons/c/cf/Muridae_-_Acomys_cilicicus.jpg","name":"Asia Minor spiny mouse","suborder":"Myomorpha","family":"Muridae","source":"https://en.wikipedia.org/wiki/Asia_Minor_spiny_mouse","genus":"Acomys","detail":"Acomys cilicicus is a small terrestrial and social rodent, living in large groups. The head and the body reach a length of 104–121 mm (4.1–4.8 in), with a tail of about 102–117 mm (4.0–4.6 in) and a weight up to 48 g. The upper side of the body is dark gray, with purple reflections, while the lower sides are yellowish-white and the flanks are light brown. The tail is hairless, scaly and shorter than the head and body. "},
{"id":16,"image":"https://upload.wikimedia.org/wikipedia/commons/8/83/Muskrat_Foraging.JPG","name":"Muskrat (Ondatra zibethicus)","suborder":"Myomorpha","family":"Cricetidae","source":"https://en.wikipedia.org/wiki/Muskrat","genus":"Ondatra","detail":"The muskrat (Ondatra zibethicus), the only species in genus Ondatra and tribe ondatrini, is a medium-sized semiaquatic rodent native to North America and an introduced species in parts of Europe, Asia, and South America. The muskrat is found in wetlands over a wide range of climates and habitats. It has important effects on the ecology of wetlands,[2] and is a resource of food and fur for humans. The muskrat is the largest species in the subfamily Arvicolinae, which includes 142 other species of rodents, mostly voles and lemmings."},
{"id":19,"image":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Gundi_Ctenodactylus_gundi_051117_2.jpg/800px-Gundi_Ctenodactylus_gundi_051117_2.jpg","name":"Common gundi","suborder":"Hystricomorpha","family":"Ctenodactylidae","source":"https://en.wikipedia.org/wiki/Common_gundi","genus":"Genus Ctenodactylus","detail":"The common gundi (Ctenodactylus gundi) is a species of rodent in the family Ctenodactylidae. It is found in Algeria, Libya, Morocco, and Tunisia. The parasitic organism Toxoplasma gondii was first described in 1908 in Tunis by Charles Nicolle and Louis Manceaux within the tissues of the gundi. The common gundi grows to a length of between 16 to 20 cm (6.3 to 7.9 in), having a stumpy tail of 10 to 20 mm (0.4 to 0.8 in). A gundi weighs about 185 g (6.5 oz). It resembles a guinea pig in appearance, having big eyes, flat ears and short limbs. Each foot has four digits and sharp, dark claws; the two hind feet have comblike bristles between the claws. Gundi's teeth are rootless."},
{"id":17,"image":"https://upload.wikimedia.org/wikipedia/commons/4/43/Laonastes_aenigmamus_-_young_male_JP_Hugot_PLOS_ONE.jpg","name":"Laotian rock rat","suborder":"Hystricomorpha","family":"Diatomyidae","source":"https://en.wikipedia.org/wiki/Laotian_rock_rat","detail":"The species was first described in a 2005 article by Paulina Jenkins and coauthors, who considered the animal to be so distinct from all living rodents, they placed it in a new family, Laonastidae. It is in the monotypic genus Laonastes. In 2006, the classification of the Laotian rock rat was disputed by Mary Dawson and coauthors. They suggested the rat belongs to the ancient fossil family Diatomyidae, which was thought to have been extinct for 11 million years,[3] since the late Miocene. It would thereby represent a Lazarus species. The animals resemble large, dark rats with hairy, thick tails like those of a squirrel. Their skulls are very distinctive and have features that separate them from all other living mammals."},
{"id":18,"image":"https://upload.wikimedia.org/wikipedia/commons/8/84/Cryptomys_mechowi_Plzen_zoo_02.2011.jpg","name":"Mechow's mole-rat","suborder":"Hystricomorpha","family":"Bathyergidae","source":"https://en.wikipedia.org/wiki/Mechow%27s_mole-rat","genus":"Fukomys","detail":"Mechow's mole-rat (Fukomys mechowii ) is a species of rodent in the family Bathyergidae. It is found in Angola, Democratic Republic of the Congo, Zambia, and possibly Malawi. Its natural habitats are moist savanna, subtropical or tropical dry shrubland, and subtropical or tropical dry lowland grassland. This mole-rat was first described by the German naturalist Wilhelm Peters in 1881. The specific epithet honours the Prussian explorer and naturalist Friedrich Wilhelm Alexander von Mechow."}]
